Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/returning_to_education/back_to_education_initiative.html.txt.tmx
Source language: en
Languages: ga

source: Back to Education Initiative
ga: Tionscnamh um Fhilleadh ar Oideachas

source: The Back To Education Initiative (BTEI) provides part-time further education courses mainly for people with less than upper second-level education
ga: Soláthraíonn an Tionscnamh um Fhilleadh ar Oideachas (TFO) cúrsaí páirtaimseartha breisoideachais do dhaoine, go príomha, nár cuireadh oideachas uachtarach dara leibhéal orthu

source: It gives individuals the opportunity to combine learning with family, work and other responsibilities
ga: Tugann sé an deis do dhaoine aonair chun foghlaim a dhéanamh i dteannta an teaghlaigh, oibre agus freagrachtaí eile

source: Anyone who has left full-time education can take part in a course, but priority will be given to those with less than upper second-level education
ga: Féadfaidh aon duine a d’fhág oideachas lánaimseartha páirt a ghlacadh i gcúrsa, ach tabharfar tús áite dóibh siúd nár bhain oideachas uachtarach dara leibhéal amach

source: BTEI courses are usually level 3 and 4 on the National Qualification Framework (NFQ)
ga: Is gnách go mbíonn cúrsaí TFO ar leibhéal 3 agus 4 ar an gCreat Náisiúnta Cáilíochtaí

source: The BTEI allows people to study part-time (up to 400 hours per year)
ga: Ceadaíonn an TFO do dhaoine chun staidéar páirtaimseartha a dhéanamh (a mhéid le 400 uair sa bhliain)

source: It is possible to obtain a major award at NFQ levels 1-6 where part-time courses are undertaken on a modular basis over time and combined to complete a major award
ga: Is féidir mórghradam a bhaint amach ar leibhéil 1-6 an CNC sa chás go dtugtar faoi chúrsaí páirtaimseartha ar bhonn modúlach le himeacht ama agus nuair a chuirtear le chéile iad chun mórghradam a chríochnú

source: The Back to Education Initiative (BTEI) provides part-time courses for adults and young people aged over 16 who left school with few or no formal qualifications or low literacy levels
ga: Soláthraíonn an Tionscnamh um Fhilleadh ar Oideachas (TFO) cúrsaí páirtaimseartha do dhaoine fásta agus óga atá os cionn 16 bliana d'aois a bhfuil ach beagán cáilíochtaí foirmiúla nó cáilíochtaí foirmiúla ar bith bainte amach acu nó a bhfuil leibhéil ísle litearthachta acu

source: The groups prioritised for participation in the BTEI are listed in the Back to Education Initiative Operational Guidelines (pdf)
ga: Tá na grúpaí a dtugtar tús áite dóibh le bheith rannpháirteach sa TFO san áireamh sa liosta sna Treoirlínte Oibríochtúla maidir leis an Tionscnamh um Fhilleadh ar Oideachas (pdf)

source: Within these groups, priority is given to those most educationally disadvantaged
ga: Laistigh de na grúpaí seo, tugtar tús áite dóibh siúd is mó atá faoi mhíbhuntáiste oideachasúil

source: You can also take part in BTEI if you are working and on a low income
ga: Sa mhullach air sin, féadfaidh tú páirt a ghlacadh sa TFO má tá tú ag oibriú agus go bhfuil ioncam íseal agat

source: The aim is to give people an opportunity to combine their learning with family, work and other commitments
ga: Is é an cuspóir ná chun deis a thabhairt do dhaoine a bhfoghlaim a dhéanamh i dteannta an dteaghlaigh, oibre agus tiomantais eile

source: The participants eligible for free tuition are people who (or their dependants):
ga: Is iad na rannpháirtithe atá i dteideal teagasc saor a fháil ná daoine (nó a gcleithiúnaithe):

source: • Have less than upper-second level education or
ga: • Nár cuireadh oideachas uachtarach dara leibhéal orthu nó

source: • Are getting a jobseeker’s payment or means-tested social welfare payment (there is a list of eligible payments in the BTEI Operational Guidelines (pdf)) or
ga: • A bhfuil íocaíocht chuardaitheora poist nó íocaíocht leasa shóisialaigh ar a ndéantar tástáil mhaoine á fáil acu (tá liosta de na híocaíochtaí incháilithe ar fáil sna Treoirlínte Oibríochtúla maidir leis an TFO (pdf)) nó

source: • Are getting Family Income Supplement or
ga: • A bhfuil Forlíonadh Ioncam Teaghlaigh á fháil acu nó

source: • Have a medical card or
ga: • A bhfuil cárta leighis acu nó

source: • Are eligible to participate on VTOS or Youthreach
ga: • Atá i dteideal páirt a ghlacadh ar SDOG nó Ógtheagmháil

source: All other participants are charged a fee
ga: Gearrtar táille ar gach rannpháirtí eile

source: For information about fees, you should contact your local Education and Training Board
ga: Chun teacht ar fhaisnéis faoi tháillí, ba cheart duit teagmháil a dhéanamh le do Bhord Oideachais agus Oiliúna áitiúil

source: In general, a training allowance is not paid, but a pro-rata training allowance may be paid to a participant that has no entitlement to a social welfare payment but is eligible for Youthreach
ga: Go ginearálta, ní íoctar liúntas oiliúna, ach d’fhéadfaí liúntas oiliúna pro-rata a íoc le rannpháirtí nach bhfuil aon teidlíocht acu d’íocaíocht leasa shóisialaigh ach atá i dteideal bheith rannpháirteach in Ógtheagmháil

source: If you are getting a social welfare payment, you may keep your payment and participate in BTEI as long as you continue to satisfy the conditions attached to your payment
ga: Má tá íocaíocht leasa shóisialaigh á fáil agat, féadfaidh tú d’íocaíocht a choimeád agus páirt a ghlacadh in TFO a fhad agus a leanann tú leis na coinníollacha a shásamh a bhaineann le d’íocaíocht

source: If you are getting a jobseeker’s payment you will need to apply for the Part-Time Education Option
ga: Má tá íocaíocht chuardaitheora poist á fáil agat, beidh ort iarratas a dhéanamh ar an Rogha Oideachais Pháirtaimseartha

source: For further information on BTEI options in your area, contact the Adult Education Officer in your local Education and Training Board (ETB) or your local Adult Guidance Service
ga: Chun teacht ar bhreis faisnéise ar roghanna TFO i do cheantar, déan teagmháil leis an Oifigeach Oideachais Aosach i do Bhord Oideachais agus Oiliúna (BOO) áitiúil nó i do Sheirbhís Treorach d’Aosaigh áitiúil

source: Apply to your local Education and Training Board
ga: Cá háit a ndéanfaidh mé iarratas

source: Provides opportunities for adult learners and early school-leavers who want to upgrade their skills
ga: Déan iarratas ar do Bhord Oideachais agus Oiliúna áitiúil
